---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.Camera.#ctor(Autodesk.Revit.DB.DirectContext3D.Camera)
source: html/f0d9f236-0d6a-f325-2ec3-cf694c6a6560.htm
---
# Autodesk.Revit.DB.DirectContext3D.Camera.#ctor Method

Camera

## Syntax (C#)
```csharp
public Camera(
	Camera other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.DirectContext3D.Camera`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null